i = [1, 2, 3, 4, 5]
j = i

j[0] = 100
print('j = ', i)
print('i = ', i)

# j =  [100, 2, 3, 4, 5]
# i =  [100, 2, 3, 4, 5]

# 参照渡しなのでjをかえるとiも変わってしまう
# なので以下のようにしよう

x = [1, 2, 3, 4, 5]

y = x.copy()
# y = x[:] でも可能

y[0] = 100
print('y = ', y)
print('x = ', x)

# y =  [100, 2, 3, 4, 5]
# x =  [1, 2, 3, 4, 5]

# アドレスをみたい
z = 20
print(id(z))
# 2332262689680


# タプル型
# t = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# print(t)

# >> t = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# >>> t.index(1)
# 0

# 配列を入れることはできる
# >>> t = ([1, 2, 3], [4, 5, 6])
# >>> t
# ([1, 2, 3], [4, 5, 6])
# >>> t[0]
# [1, 2, 3]
# >>> t[0][0]
# 1
# >>> t = 1
# >>> type(t)
# <class 'int'>
# >>> t = ()
# >>> t = (1)
# >>> t
# 1
# >>>

# タプルを現すときは
# t = 1,
# をつける

# 22. タプルのアンパッキング
num_tuple = (10, 20)
print(num_tuple)

x, y = num_tuple
print(x, y)


# タプルを使うと，文字の入れ替えも容易にできる
# 以前までのやり方
i = 10
j = 20
tmp = i
i = j
j = tmp

print(i, j)

a = 100
b = 200
print(a, b)
a, b = b, a
print(a, b)
